local/modules/yauheni.dpd/sdk/src/lib/API/Client/logs/acb4b68dd2bf21e0e550dd8d974c30f5.logs

LOCATION: 
http://ws.dpd.ru:80/services/order2
REQUEST : 
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://dpd.ru/ws/order2/2012-04-04"><SOAP-ENV:Body><ns1:createOrder><orders><auth><clientNumber>1104009153</clientNumber><clientKey>9CCE8C68288349CBFE56E5D420CFA807268B6845</clientKey></auth><header><datePickup>2020-01-24</datePickup><senderAddress><name>ООО "Сэльвин-Логистик" - TEST TEST TEST</name><terminalCode>MSQ</terminalCode><contactFio>BH.BY ALL.BH.BY</contactFio><contactPhone>+375447480824</contactPhone><contactEmail></contactEmail><needPass>false</needPass></senderAddress><pickupTimePeriod>9-18</pickupTimePeriod></header><order><orderNumberInternal>17808</orderNumberInternal><serviceCode>CSM</serviceCode><serviceVariant>ТД</serviceVariant><cargoNumPack>1</cargoNumPack><cargoWeight>1</cargoWeight><cargoVolume>0.004</cargoVolume><cargoRegistered>false</cargoRegistered><cargoValue>39.34</cargoValue><cargoCategory>косметические товары</cargoCategory><receiverAddress><name>Венчикова Ирина Александровна</name><countryName>Беларусь</countryName><region>Брестская</region><city>Пинск</city><street>улица Ленина</street><house>27</house><contactFio>Венчикова Ирина Александровна</contactFio><contactPhone>375298617853</contactPhone><contactEmail></contactEmail><needPass>false</needPass></receiverAddress><extraService><esCode>НПП</esCode><param><name>sum_npp</name><value>39.34</value></param></extraService></order></orders></ns1:createOrder></SOAP-ENV:Body></SOAP-ENV:Envelope>

ANSWER  : 
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:createOrderResponse xmlns:ns2="http://dpd.ru/ws/order2/2012-04-04"><return><orderNumberInternal>17808</orderNumberInternal><orderNum>BY028506922</orderNum><status>OK</status></return></ns2:createOrderResponse></S:Body></S:Envelope>
